---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Column
enum: Autodesk.Revit.DB.Structure.StructuralInstanceUsage
zh: 柱、柱子
source: html/e536d231-3150-e5bc-7cfd-83e58b05bc75.htm
---
# Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Column

**中文**: 柱、柱子

Structural usage is as column.